Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: This next code snippet defines an optional Customer variable called john, which will be used to store a reference to a specific customer.
ja: 次のコード断片は、johnと呼ばれる、オプショナルのCustomer変数を定義します。それは、特定の顧客への参照を格納するために使われます。

source: This next code snippet defines two variables of optional type called john and unit4A, which will be set to a specific Apartment and Person instance below.
ja: この次のコード断片はjohnとunit4Aと呼ばれるオプショナルの型の２つの変数を定義します、それは、特定のApartmentとPersonインスタンスに以降で設定されます。

source: This next example shows a class called DiceGameTracker, which adopts the DiceGameDelegate protocol:
ja: この次の例はDiceGameTrackerと呼ばれるクラスを示します、それは、DiceGameDelegateプロトコルを採用します：

source: This number is then shifted 16 places to the right (>> 16).
ja: この数は、それから右に16桁シフトされます（>> 16）。

source: This observer performs two checks:
ja: このオブザーバーは、２つのチェックをします：

source: This operator adds together the x values of two vectors, and subtracts the y value of the second vector from the first.
ja: この演算子は、２つのベクトルのx値を一緒に加えて、第二のベクトルのy値を最初のものから減じます。

source: This operator does not have an existing meaning in Swift, and so it is given its own custom meaning below in the specific context of working with Vector2D instances.
ja: この演算子は、スウィフトにおいて既存の意味を持ちません、なので、それはVector2Dインスタンスを扱う特定の文脈の下で、独自のあつらえの意味を与えられます。

source: This opt-in approach prevents hidden conversion errors and helps make type conversion intentions explicit in your code.
ja: このオプトインの（個々に決めていく）取り組み方は、隠された変換エラーを防いで、あなたのコードにおいて型変換の意図を明確にするのを助けます。

source: This optional binding is written “if let movie = item as? Movie”, which can be read as:
ja: このオプショナル束縛は「if let movie = item as? Movie」のように書かれます、それは、次のように解釈されることができます：

source: This optional value contains the old value for that key if one existed before the update, or nil if no value existed:
ja: このオプショナルの値は、それが更新の前に存在するならばそのキーに対する古い値を、値が存在しないならばnilを含みます：

source: This output value is then shifted eight places to the right, giving a value of 0x66, which has a decimal value of 102.
ja: この出力値は、それから８桁右にシフトされて、0x66の値を与えます、それは10進の値の102を持ちます。

source: This part of the book describes the formal grammar of the Swift programming language.
ja: 本のこの部分は、スウィフトプログラミング言語の形式文法を記述します。

source: This performance optimization means you don’t have to pay the performance cost of copying memory until you modify either the string or substring.
ja: この性能最適化が意味するのは、あなたがメモリをコピーする性能経費を、あなたが文字列か下位文字列のどちらかを修正するまでは払う必要がないことです。

source: This placeholder is replaced with the actual value of multiplier when the string interpolation is evaluated to create an actual string.
ja: このプレースホルダーは、文字列補間が実際の文字列を作成するために評価されるとき、multiplierの実際の値と取り替えられます。

source: This procedure is known as switching on the value that is being considered.
ja: この手順は、考察されている値での切り替え（スイッチング）として知られています。

source: This process continues until the end of the range is reached.
ja: この過程は、範囲の終わりに達するまで続きます。

source: This process involves setting an initial value for each stored property on that instance and performing any other setup or initialization that is required before the new instance is ready for use.
ja: この過程は、そのインスタンスの格納プロパティそれぞれに初期値を設定すること、および新しいインスタンスの使用準備が整う前に必要とされる他のあらゆる設定や初期化を行うことを含みます。

source: This process is described in Resolving Strong Reference Cycles Between Class Instances.
ja: この過程は、クラスインスタンス間の強い参照循環の解消で記述されます。

source: This process is described in Modifying Value Types from Within Instance Methods.
ja: この過程は、値型をインスタンスメソッド内から修正するで記述されます。

source: This process is described in Working with Characters.
ja: このやり方は文字を扱うで記述されます。

source: This process satisfies safety check 1 from Two-Phase Initialization above.
ja: この過程は、上記の２段階初期化の安全点検１を満たします。

source: This process transforms it into the tree (2 + (3 * 5)).
ja: この処理は、それをツリー(2 + (3 * 5))に変えます。

source: This process, known as initializer delegation, avoids duplicating code across multiple initializers.
ja: この処理、イニシャライザ委任として知られるものは、複数のイニシャライザにまたがってコードを繰り返し複製することを避けます。

source: This property is of type String.UTF16View, which is a collection of unsigned 16-bit (UInt16) values, one for each 16-bit code unit in the string’s UTF-16 representation:
ja: このプロパティは型String.UTF16Viewです、そしてそれは、符号なし16ビット（UInt16）の値の集まりで、そのひとつがその文字列のUTF-16叙述における各16ビット符号単位です：

source: This property is of type String.UTF8View, which is a collection of unsigned 8-bit (UInt8) values, one for each byte in the string’s UTF-8 representation:
ja: このプロパティは型String.UTF8Viewです、そしてそれは、符号なし８ビット（UInt8）の値の集まりで、それぞれがその文字列のUTF-８叙述における各バイトです：

source: This property is of type UnicodeScalarView, which is a collection of values of type UnicodeScalar.
ja: このプロパティは型UnicodeScalarViewです、そしてそれは、UnicodeScalar型の値の集まりです。

source: This property references a closure that combines name and text into an HTML string fragment.
ja: このプロパティは、nameとtextをHTML文字列断片に結合するクロージャに参照をつけます。

source: This protocol doesn’t specify how the items in the container should be stored or what type they’re allowed to be.
ja: このプロトコルは、コンテナの中の項目が格納されなければならない方法やそれらが許される型が何であるかを指定しません。

source: This protocol, RandomNumberGenerator, requires any conforming type to have an instance method called random, which returns a Double value whenever it’s called.
ja: このプロトコル、RandomNumberGeneratorは、あらゆる準拠型にrandomと呼ばれるインスタンスメソッドを持つことを要求します、それは、それが呼ばれた時はいつでもあるDouble値を返すものです。

source: This provides a syntactically convenient way to defer the evaluation of an expression without needing to write an explicit closure when you call the function.
ja: これは、あなたがその関数を呼び出す時に明示的なクロージャを書く必要なしに、ある式の評価を延期する統語的に便利な方法を提供します。

source: This provision ensures that the switch statement is exhaustive.
ja: この条項は、switch文が網羅的であることを確実にします。

source: This public-facing interface is the application programming interface (or API) for the framework.
ja: この公開向けインタフェースは、フレームワークのためのアプリケーション・プログラミング・インタフェース（またはAPI）です。

source: This pushes its binary representation just over the size that a UInt8 can hold, causing it to overflow beyond its bounds, as shown in the diagram below.
ja: これは、そのバイナリの表現をちょうどUInt8が持つことができる大きさ以上に押し広げて、それを、下の図で示すように、その境界を越えてあふれさせます。

source: This relationship has the potential to create a strong reference cycle.
ja: この関係は、強い参照循環をつくる可能性を持ちます。

source: This requests the sixth entry in the three-times-table, which returns a value of 18, or 3 times 6.
ja: これは九九の３の段において６番目の部分を要請します、それは値18、つまり3掛ける6を返します。

source: This requirement ensures that the public-facing API for a type is something you opt in to publishing, and avoids presenting the internal workings of a type as public API by mistake.
ja: この要件は、ある型のための公開向けAPIがあなたが公開するように選ぶ何かであることを確実にして、ある型の内部の働きを誤って公開のAPIとして公表することを避けます。

source: This requirement is enforced by a type constraint on the key type for Dictionary, which specifies that the key type must conform to the Hashable protocol, a special protocol defined in the Swift standard library.
ja: この要件は、Dictionaryのためのキー型に関する型制約によって強制されます、それは、キー型がスウィフト標準ライブラリで定義される特別なプロトコル、Hashableプロトコルに準拠しなければならないことを示します。

source: This requirement is expressed through a combination of type constraints and a generic where clause:
ja: この要件は、型制約と総称体where節の組合せによって表されます：

source: This restriction helps Swift perform more of its checks for conflicting access to memory at compile time instead of at runtime.
ja: この規制は、スウィフトが実行時ではなくコンパイル時にメモリへのアクセスの衝突についてより多くのそれの検査を実行する助けとなります。

source: This restriction is demonstrated in the example below.
ja: この制限は、下の例において実演されます。

source: This restriction protects the implementation details of the TrackedString edit-tracking functionality, while still providing convenient access to an aspect of that functionality.
ja: この制限は、TrackedString編集追跡機能性の実装詳細を保護します、その一方でその機能性の一面への便利なアクセスを依然として提供します。

source: This rule also applies to type aliases for associated types used to satisfy protocol conformances.
ja: この規則はまた、プロトコル準拠を満たすために使われる関連型のための型エイリアスにも適用されます。

source: This rule applies to stored properties as well as computed properties.
ja: この規則は、格納プロパティに、それだけでなく計算プロパティにも適用されます。

source: This rule pertains even though type property requirements can be prefixed with the class or static keyword when implemented by a class:
ja: たとえ型プロパティ要件がクラスによって実装されるときclassまたはstaticキーワードを前に置かれるとしても、この規則は当てはまります：

source: This satisfies rules 2 and 3 from above.
ja: これは、上記の規則２と３を満たします。

source: This scenario is best resolved with a weak reference.
ja: この筋書きは、弱い参照で最もよく解消されます。

source: This scenario is best resolved with an unowned reference.
ja: この筋書きは、非所有参照で最もよく解消されます。

source: This section shows you how to set up such a relationship.
ja: この節は、あなたにそのような関係を設定する方法を教えます。

source: This section shows you how to write a generic collection type called Stack.
ja: この節は、あなたにStackと呼ばれる総称体コレクション型を書く方法を示します。

source: This simplified syntax lets you omit an optional pattern.
ja: この簡略化された構文は、あなたにあるオプショナルパターンを省略させます。

source: This sort of operator usually takes arguments of type Self, matching whatever concrete type adopts the protocol, but adding a Self requirement to the protocol doesn’t allow for the type erasure that happens when you use the protocol as a type.
ja: この種の演算子は通常は、どんな具象型がそのプロトコルを採用しても合う、型Selfの引数を取ります、しかしSelf要件をプロトコルに加えることは型消去を想定しません、それはあなたがプロトコルをひとつの型として使う場合に予期せず起こります。

source: This square is represented by the blue square in the diagram below.
ja: この正方形は、下の図において青い正方形で表されます。

source: This statement consists of the defer keyword and the statements to be executed later.
ja: この文は、deferキーワードと後で実行される文から成ります。

source: This statement lets you do any necessary cleanup that should be performed regardless of how execution leaves the current block of code—whether it leaves because an error was thrown or because of a statement such as return or break.
ja: この文は、あなたに何らかの不可欠なクリーンアップを行わせます、それはどうやって実行が現在のコードブロックから離れるか ― それがエラーがスローされたためにまたはreturnまたはbreakのような文を理由に離れるかどうかに関係なく実行されるべきものです。

source: This strong reference cycle occurs because closures, like classes, are reference types.
ja: この強い参照循環は、クロージャが、クラスの様に参照型であるために起こります。

source: This structure also has a read-only computed property called volume, which calculates and returns the current volume of the cuboid.
ja: この構造体はまた、volumeと呼ばれる読み出し専用の計算プロパティを持ちます、それは、現在の立方体の体積を計算して、返します。

source: This structure encapsulates the fact that most cards have one value, but the Ace card has two values.
ja: この構造体は、大部分のカードが１つの値を持つという事実をカプセル化します、しかし「エース」カードは２つの値を持ちます。

source: This structure has two stored properties called width and height.
ja: この構造体は、２つの格納プロパティ、widthとheightと呼ばれるものを持ちます。

source: This structure uses an Array property called items to store the values in the stack.
ja: この構造体は、itemsと呼ばれるArrayプロパティを使って値をスタックに格納します。

source: This subscript [n] returns the decimal digit n places in from the right of the number:
ja: この添え字[n]は、右の数からの10進桁n位置を返します：

source: This subscript setting attempt also fails, because residence is currently nil.
ja: この添え字設定の試みはまた失敗します、なぜならresidenceが現在nilだからです。

source: This syntactic convenience lets you omit braces around a function’s parameter by writing a normal expression instead of an explicit closure.
ja: この統語上の便宜は、明示的なクロージャの代わりに通常の関数を書くことによって、あなたに関数のパラメータのまわりの波括弧を省略させます。

source: This syntax is the most general way to use a property wrapper.
ja: この構文は、プロバティラッパーを使う最も一般的な方法です。

source: This tag contains the optional text value if it exists, or no text content if text does not exist.
ja: このタグは、それが存在するならばオプショナルのtext値を、あるいはtextが存在しないならば、無いテキスト内容を含みます。

source: This tells Swift to execute the closure immediately.
ja: これは、スウィフトにこのクロージャを直ちに実行するように言います。

source: This tells Swift to “chain” on the optional residence property and to retrieve the value of numberOfRooms if residence exists.
ja: これはスウィフトに、オプショナルのresidenceプロパティの上に「繋げて」、そしてresidenceが存在するならばnumberOfRoomsの値を取り出すように言います。

source: This time around, the Apartment type’s tenant property is declared as a weak reference:
ja: 今度は、Apartment型のtenantプロパティは、弱い参照として宣言されます：

source: This time around, the game has an extra rule:
ja: このたびは、このゲームは特別な規則を持ちます：

source: This time, however, the associated values are extracted as part of the switch statement.
ja: 今度は、しかし、関連値がスイッチ文の一部として抽出されます。

source: This time, the Residence class defines a variable property called rooms, which is initialized with an empty array of type [Room]:
ja: 今度は、Residenceクラスはroomsと呼ばれる変数プロパティを定義します、それは、型[Room]の空の配列で初期化されます：

source: This time, the capture of self by the closure is an unowned reference, and does not keep a strong hold on the HTMLElement instance it has captured.
ja: 今度は、クロージャによるselfの捕獲は非所有参照であって、それが捕獲しているHTMLElementインスタンスに対する強い支配力を保ちません。

source: This time, the sign bit is 1 (meaning “negative”), and the seven value bits have a binary value of 124 (which is 128 - 4):
ja: 今度は、符号ビットは1です（「負」を意味します）、そして、７つの値ビットは２進数の値の124を持ちます（それは、128 - 4です）：

source: This time, the type parameter Element is used as the type of the append(_:) method’s item parameter and the return type of the subscript.
ja: 今度は、型パラメータElementが、append(_:)メソッドのitemパラメータの型および添え字の戻り型として使われます。

source: This tour gives you enough information to start writing code in Swift by showing you how to accomplish a variety of programming tasks.
ja: このツアーはあなたにスウィフトでコードを書き始めるのに十分な情報を、どうやって様々なプログラミング作業を達成するかをあなたに示すことによって提供します。

source: This type parameter is written within a pair of angle brackets (<Element>) immediately after the structure’s name.
ja: この型パラメータは、構造体の名前の直後に一対の山形括弧の内部で（<Element>）書かれます。

source: This value is stored in a type property called highestUnlockedLevel.
ja: この値は、highestUnlockedLevelと呼ばれる型プロパティに格納されます。

source: This variable has an initial value of nil, by virtue of being optional:
ja: オプショナルであるおかげで、この変数はnilの初期値を持ちます：

source: This variable is initialized with a value of 0.
ja: この変数は、値0で初期化されます。

source: This version is adapted to use a Dice instance for its dice-rolls; to adopt the DiceGame protocol; and to notify a DiceGameDelegate about its progress:
ja: この版は改変され、それにより、それのさいころ振りにDiceインスタンスを使用します；DiceGameプロトコルを採用します；そして、その進歩についてDiceGameDelegateに通知します：

source: This version of Residence also provides a method called printNumberOfRooms, which simply prints the number of rooms in the residence.
ja: Residenceのこの版もprintNumberOfRoomsと呼ばれるメソッドを提供します、それは、単にその住居の部屋数を出力します。

source: This version of protoFlip(_:) has the same body as flip(_:), and it always returns a value of the same type.
ja: このバージョンのprotoFlip(_:)は、flip(_:)と同じ本文を持ちます、そしてそれは常に同じ型の値を返します。

source: This version of the Shape class is missing something important: an initializer to set up the class when an instance is created.
ja: Shapeクラスのこの版は、重要なあるもの：インスタンスが作られるときにクラスを設定準備するイニシャライザ（初期化子）、が欠けています。

source: This version of the game is wrapped up as a class called SnakesAndLadders, which adopts the DiceGame protocol.
ja: ゲームのこの改作は、SnakesAndLaddersと呼ばれるクラスで包まれます、それは、DiceGameプロトコルを採用します。

source: This version of the game uses a while loop and a switch statement to implement the game’s logic.
ja: ゲームのこの改変板は、このゲームの論理を実装するためにwhileループとswitch文を使います。

source: This version of the mutating moveBy(x:y:) method creates a new structure whose x and y values are set to the target location.
ja: 変更moveBy(x:y:)メソッドのこの改作は、それの持つxとyの値が目標場所に設定される、新しい構造体を作成します。

source: This violates the requirement to return values of only one type and makes invalidFlip(_:) invalid code.
ja: これは、ただ１つの型だけの値を返すという要件に違反します、そしてinvalidFlip(_:)を無効なコードにします。

source: This wouldn’t be the case if you had written the initializer as part of the value type’s original implementation, as described in Initializer Delegation for Value Types.
ja: 値型のためのイニシャライザ委任で記述されるように、あなたがイニシャライザをその値型の最初の実装の一部として書いたならば、それはこの場合にはなりません。

source: Those roles are reversed for a function with an opaque return type.
ja: それらの役割は、不透明戻り型をもつある関数に対しては逆にされます。

source: Those two values are compared, and the result of that comparison determines the overall result of the tuple comparison.
ja: そのような２つの値が比較されます、するとその比較の結果がタプル比較の結果全体を決定します。

source: Throw Statement
ja: throw文

source: Throwing Functions and Methods
ja: スローを行う関数とメソッド

source: Throwing an error lets you indicate that something unexpected happened and the normal flow of execution can’t continue.
ja: エラーのスローがあなたに示すのは、何か予期せぬことが起こった、そして通常の実行の流れは続けることができないということです。

source: Throwing and rethrowing functions are described in Throwing Functions and Methods and Rethrowing Functions and Methods.
ja: スローおよび再スロー関数は、スロー関数とメソッドと再スロー関数とメソッドにおいて記述されます。

source: Throwing and rethrowing functions can transfer program control to an appropriate catch block, even when they are nonreturning.
ja: スローおよび再スロー関数は、制御を適切なcatchブロックに移すことができます、それらが非復帰である場合でさえも。

source: Throwing initializers can propagate errors in the same way as throwing functions.
ja: スローするイニシャライザは、スローする関数と同じ方法でエラーを伝達できます。

source: Throwing, catching, and propagating errors is covered in greater detail in Error Handling.
ja: エラーのスロー、キャッチ、そして伝達は、詳細にエラー処理において扱われます。

source: To access a value using a key path, pass the key path to the subscript(keyPath:) subscript, which is available on all types.
ja: キーパスを使ってある値にアクセスするには、そのキーパスをsubscript(keyPath:)添え字に渡してください、それは全ての型で利用可能です。

source: To access an index farther away from the given index, you can use the index(_:offsetBy:) method instead of calling one of these methods multiple times.
ja: 与えられたインデックスからもっと遠く離れたインデックスにアクセスするには、あなたはこれらのメソッドのうちの１つを複数回呼び出すことの代わりにindex(_:offsetBy:)メソッドを使うことができます。

source: To accomplish this, Swift enables you to define nested types, whereby you nest supporting enumerations, classes, and structures within the definition of the type they support.
ja: これを達成するために、スウィフトはあなたに入れ子にされた型を定義するのを可能にします、それによってあなたは、補助の列挙、クラス、そして構造体をそれらが支援をする型の定義の範囲内で入れ子にします。

source: To accomplish this, you define one input parameter—a String value called person—and a return type of String, which will contain a greeting for that person:
ja: これを達成するために、あなたは１つの入力パラメータ ― personと呼ばれるString値 ― そしてその人のための挨拶を含むことになる、Stringの戻り型を定義します：

source: To achieve these aims, you can mark a loop statement or conditional statement with a statement label.
ja: これらの狙いを達成するために、あなたはループ文または条件文に文ラベルで印をつけることができます。

source: To achieve this, an extra rule is used when signed integers are shifted to the right: When you shift signed integers to the right, apply the same rules as for unsigned integers, but fill any empty bits on the left with the sign bit, rather than with a zero.
ja: これを達成するために、符号つき整数が右へシフトされるとき、特別な規則が使われます：あなたが符号つき整数を右にシフトする時は、符号なし整数と同じ規則を適用してください、しかし、その左のあらゆる空のビットを、ゼロではなく符号ビットで満たしてください。

source: To achieve this, the Container protocol declares an associated type called Item, written as associatedtype Item.
ja: これを達成するために、ContainerプロトコルはItemと呼ばれる関連型を宣言します、それはassociatedtype Itemのように書かれます。

source: To achieve this, the array’s size, and an initial cell value of 0.0, are passed to an array initializer that creates and initializes a new array of the correct size.
ja: これを達成するために、この配列の大きさ、そして0.0の初期セル値は、正しいサイズの新しい配列をつくって初期化する配列イニシャライザに渡されます。

source: To add protocol conformance, you write the protocol names the same way as you write them for a class or structure:
ja: プロトコル準拠を加えるには、あなたはそれらプロトコル名を、あなたがそれらをクラスや構造体に対して書くのと同じ方法で記述します。

source: To align the values and statements, the unary plus operator (+i) is explicitly used with the unary minus operator (-i) and numbers lower than 10 are padded with zeros.
ja: 値と文を整列するために、単項プラス演算子（+i）が明示的に単項マイナス演算子（-i)とともに使われます、そして10より低い数はゼロを詰められます。

source: To assist with these assertions, Matrix includes a convenience method called indexIsValid(row:column:), which checks whether the requested row and column are inside the bounds of the matrix:
ja: これらの表明を手伝うために、MatrixはindexIsValid(row:column:)と呼ばれるある便利なメソッドを含みます、それは要請されたrowとcolumnが行列の境界の内側にあるかどうか確認します：

source: To calculate 9 % 4, you first work out how many 4s will fit inside 9:
ja: 9 % 4を計算するために、あなたは最初にどれくらい多くの4が9の中に収まるかを考え出します：

source: To check the values of enumeration cases, use a switch statement, as shown in Matching Enumeration Values with a Switch Statement.
ja: 列挙ケース節の値を調べるために、列挙値をスイッチ文で照合するで示されるように、switch文を使ってください。

source: To check whether a set contains a particular item, use the contains(_:) method.
ja: ある集合が特定の項目を含むかどうか調べるために、contains(_:)メソッドを使ってください。

source: To check whether a string has a particular string prefix or suffix, call the string’s hasPrefix(_:) and hasSuffix(_:) methods, both of which take a single argument of type String and return a Boolean value.
ja: ある文字列が特定の文字列接頭辞または接尾辞を持つかどうか調べるために、文字列のhasPrefix(_:)とhasSuffix(_:)メソッドを呼んでください、それらの両方ともただ１つのString型の引数をとって、ブールの値を返します。

source: To compare tuples with seven or more elements, you must implement the comparison operators yourself.
ja: ７つまたはそれより多い要素のタプルを比較するには、あなたは比較演算子をあなた自身で実装しなければなりません。

source: To conform to this version of Container, the container’s Item type has to conform to the Equatable protocol.
ja: このバージョンのContainerに準拠するには、コンテナのもつItem型はEquatableプロトコルに準拠しなければなりません。

source: To convert one specific number type to another, you initialize a new number of the desired type with the existing value.
ja: １つの特定の数の型を他のものに変換するために、あなたは望む型の新しい数を既存の値で初期化します。

source: To cope with initialization conditions that can fail, define one or more failable initializers as part of a class, structure, or enumeration definition.
ja: 失敗の可能性がある初期化状況にうまく対処するために、１つ以上の失敗可能なイニシャライザをクラス、構造体、または列挙定義の一部として定義してください。

source: To cope with this requirement, you declare the capitalCity property of Country as an implicitly unwrapped optional property, indicated by the exclamation point at the end of its type annotation (City!).
ja: この必要条件に対処するために、あなたはCountryのcapitalCityプロパティを、暗黙的にアンラップされるオプショナルのプロパティとして、その型注釈の終わりに感嘆符で示して宣言します（City!）。

source: To cope with this scenario, the code checks that square is less than the board array’s count property.
ja: この事態に対処するために、コードは、squareがboard配列のcountプロパティより少ないことを確認します。

source: To cope with this, the example above uses optional binding to check whether the optional Movie actually contains a value (that is, to find out whether the downcast succeeded.)
ja: これに対処するために、上の例は、オプショナル束縛を使って、オプショナルのMovieが実際に値を含むかどうか調べます（すなわち、ダウンキャストが成功したかどうか探り出します）。

source: To create a property called items, which is initialized with an empty array of values of type Element
ja: itemsと呼ばれるプロパティをつくる所で、それは、型Elementの値が入る空の配列で初期化されます

source: To create an empty String value as the starting point for building a longer string, either assign an empty string literal to a variable, or initialize a new String instance with initializer syntax:
ja: より長い文字列をつくるための出発点として空のString値を作成するために、変数に空のリテラル文字列を代入するか、イニシャライザ構文で新しいStringインスタンスを初期化してください：

source: To create an empty array or dictionary, use the initializer syntax.
ja: 空の配列または辞書を作成するために、初期化構文を使ってください。

source: To declare a class or static method requirement in a protocol declaration, mark the method declaration with the static declaration modifier.
ja: クラスまたは静的メソッド要件をあるプロトコル宣言において宣言するために、そのメソッド宣言をstatic宣言修飾子で印してください。

source: To declare a constant type property, mark the declaration with the static declaration modifier.
ja: 定数型プロパティを宣言するために、宣言にstatic宣言修飾子で印をつけてください。

source: To declare a failable initializer that produces an implicitly unwrapped optional instance, append an exclamation point instead (init!).
ja: 暗黙的にアンラップされるオプショナルインスタンスを生成する失敗できるイニシャライザを宣言するために、代わりに感嘆符を加えてください（init!）。

source: To declare a failable initializer that produces an optional instance, append a question mark to the init keyword in the initializer declaration (init?).
ja: オプショナルインスタンスを生成する失敗できるイニシャライザを宣言するために、イニシャライザ宣言において疑問符をinitキーワードに加えてください（init?）。

source: To declare a static subscript requirement in a protocol declaration, mark the subscript declaration with the static declaration modifier.
ja: 静的添え字要件をプロトコル宣言において宣言するには、その添え字宣言をstatic宣言修飾子で印してください。

source: To declare a subscript that’s exposed by the type, rather than by instances of the type, mark the subscript declaration with the static declaration modifier.
ja: 型によって、その型のインスタンスによってではなく、露出される添え字を宣言するには、添え字宣言をstatic宣言修飾子で印してください。

source: To declare a type property requirement in a protocol declaration, mark the property declaration with the static keyword.
ja: ある型プロパティ要件をプロトコル宣言の中で宣言するには、そのプロパティ宣言をstaticキーワードで印してください。
